test-artillery/artillery-test.yml
config:
  target: "http://192.168.50.4"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm-up phase"
    - duration: 120
      arrivalRate: 20
      rampTo: 50
      name: "Ramp-up phase"
    - duration: 180
      arrivalRate: 50
      name: "Sustained load phase"
  http:
    maxSockets: 50
scenarios:
  - flow:
      - get:
          url: "/users"